SaitovSP/src/Documents/Инкасация/Инкасация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инкасация</name>
  <registerRecords>AccumulationRegister.ДенежныеСредстваСети</registerRecords>
  <attributes>
    <name>РесторанИнкасации</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыручкаРесторана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

SaitovSP/src/AccumulationRegisters/ДенежныеСредстваСети/ДенежныеСредстваСети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваСети</name>
  <resources>
    <name>Выручка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SaitovSP/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SaitovSP/src/Documents/ЗакрытиеСмены/ЗакрытиеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеСмены</name>
  <registerRecords>AccumulationRegister.ДенежныеСредстваСети</registerRecords>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

SaitovSP/src/Documents/Инкасация/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Дата = '00010101' Тогда
		Объект.Дата = ТекущаяДата();
		Объект.РесторанИнкасации = ПараметрыСеанса.ТекущийРесторан;
		Объект.Офис = ПредопределенноеЗначение("Справочник.Рестораны.ЦентральныйОфис");
	КонецЕсли;
	
	///ЗАполнение выручки ресторана и сообщение о сумме долга перед поставщиками
	
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредстваСетиОстатки.ВыручкаОстаток КАК ОстатокСредствРесторана
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваСети.Остатки(, Ресторан = &Ресторан) КАК ДенежныеСредстваСетиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДолгиПоставщикамОстатки.СуммаОстаток КАК ОстатокДолгаПоставщикам
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки(, Ресторан = Ресторан) КАК ДолгиПоставщикамОстатки";
	
	Запрос.УстановитьПараметр("Ресторан", Объект.РесторанИнкасации);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДенежныеОстатки = МассивРезультатов[0].Выбрать();
	
	Пока ВыборкаДенежныеОстатки.Следующий() Цикл
		Объект.ВыручкаРесторана = ВыборкаДенежныеОстатки.ОстатокСредствРесторана;
	КонецЦикла;
	
	ВыборкаДолгиПоставщикам = МассивРезультатов[1].Выбрать();
	
	Пока ВыборкаДолгиПоставщикам.Следующий() Цикл
		ДолгПередПоставщиками = ВыборкаДолгиПоставщикам.ОстатокДолгаПоставщикам;
	КонецЦикла;
	
	

	
КонецПроцедуры

&НаКлиенте
Процедура РесторанИнкасацииПриИзменении(Элемент)
	Объект.ВыручкаРесторана = ВыручкаРесторана(Объект.РесторанИнкасации, Объект.Дата); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыручкаРесторана (Ресторан, Период)
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредстваСетиОстатки.ВыручкаОстаток КАК ВыручкаОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваСети.Остатки(&Период, Ресторан.Ссылка = &Ресторан) КАК ДенежныеСредстваСетиОстатки";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Ресторан", Ресторан);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ВыручкаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьСмену(Команда)
		
	ЗакрытьСменуСервер()
	
КонецПроцедуры 

&НаСервере
Процедура ЗакрытьСменуСервер()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредстваСетиОстатки.Ресторан КАК Ресторан,
		|	ДенежныеСредстваСетиОстатки.ВыручкаОстаток КАК ВыручкаОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваСети.Остатки(&Период, Ресторан = &Ресторан) КАК ДенежныеСредстваСетиОстатки";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата()); 
	Запрос.УстановитьПараметр("Ресторан", Объект.РесторанИнкасации);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВыручкаОстаток > Объект.Сумма Тогда
			
			ДокИнкасация = Документы.ЗакрытиеСмены.СоздатьДокумент();
		
			ДокИнкасация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		Иначе
			Сообщить("Сумма инкасации больше суммы остатка ресторана");
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сообщить("Общая сумма долга перед поставщиками составляет " + ДолгПередПоставщиками + " рублей.");
КонецПроцедуры
